snlkuharlocal/src/InformationRegisters/СостояниеСкановДокументов/СостояниеСкановДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостояниеСкановДокументов</name>
  <resources>
    <name>СостояниеЭлектронногоДокумента</name>
    <type>
      <types>EnumRef.СостояниеЭлектронныхДокументов</types>
    </type>
  </resources>
  <resources>
    <name>НомерКоробки</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.РасходнаяНакладная</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/InformationRegisters/ЖурналИзмененийРеквизитов/ЖурналИзмененийРеквизитов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЖурналИзмененийРеквизитов</name>
  <resources>
    <name>СтароеЗначение</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НовоеЗначение</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСообщения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>ExchangePlanRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяРеквизита</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/InformationRegisters/СостояниеСкановДокументов/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
	//кухарь 20.10.14 начало
	//запись изменений  в регистр журнал изменений 	
	СтароеЗначение=ПолучитьСтароеЗначение();
	Для каждого стр из СтароеЗначение Цикл 
		ЗаписатьВЖурналИзмененийРеквизитов(стр.Документ,стр.ИмяРеквизита,стр.ЗначениеРеквизита,0,ОбменДанными,Истина);
	КонецЦикла;
	Для Каждого Запись Из ЭтотОбъект Цикл
		//кухарь 23.10.14 начало
		//ЗаписатьВЖурналИзмененийРеквизитов(Запись.Документ,запись.ИмяРеквизита,СтароеЗначение,Запись.ЗначениеРеквизита,ОбменДанными,ложь);
		ЗаписатьВЖурналИзмененийРеквизитов(Запись.Документ,"НомерКоробкиЭД","",Запись.НомерКоробки,ОбменДанными,ложь);
		//кухарь 23.10.14 конец
	КонецЦикла; 	
	//кухарь 20.10.14 конец

КонецПроцедуры


//кухарь 20.10.14 начало
//запись изменений  в регистр журнал изменений 

Процедура ЗаписатьВЖурналИзмененийРеквизитов(Документ,ИмяРеквизита,СтароеЗначение,НовоеЗначение,ОбменДанными,ПерваяЗапись)
	
	если ПерваяЗапись Тогда 
		Запись=РегистрыСведений.ЖурналИзмененийРеквизитов.СоздатьМенеджерЗаписи();
		
		Запись.Дата				=ТекущаяДата();
		Запись.Документ			=Документ;
		Запись.ТипДокумента		=Документ.метаданные().имя;
		Запись.ИмяРеквизита		=ИмяРеквизита;
		Запись.СтароеЗначение	=СтароеЗначение;
		Запись.НовоеЗначение	=0;
		Запись.Пользователь		=ПараметрыСеанса.Пользователь;
		Если ОбменДанными.Загрузка Тогда
			Запись.Отправитель		=ОбменДанными.Отправитель;		
			Запись.НомерСообщения	=ПараметрыСеанса.НомерСообщения;
		КонецЕсли;	
		Запись.Записать();
	иначе		
		ДанныеВБазе=РегистрыСведений.ЖурналИзмененийРеквизитов.СоздатьНаборЗаписей();		
		ДанныеВБазе.Отбор.Документ.Установить(Документ);
		ДанныеВБазе.Отбор.ИмяРеквизита.Установить(ИмяРеквизита);	
		ДанныеВБазе.Прочитать();
		Для Каждого Запись Из ДанныеВБазе Цикл
			СтароеЗначение=Запись.СтароеЗначение;
		КонецЦикла;
		//кухарь 23.10.14 начало 
		если СтароеЗначение<>НовоеЗначение тогда
			//кухарь 23.10.14 конец
			Запись=РегистрыСведений.ЖурналИзмененийРеквизитов.СоздатьМенеджерЗаписи();		
			Запись.Дата				=ТекущаяДата();
			Запись.Документ			=Документ;
			Запись.ТипДокумента		=Документ.метаданные().имя;
			Запись.ИмяРеквизита		=ИмяРеквизита;
			Запись.СтароеЗначение	=СтароеЗначение;
			Запись.НовоеЗначение	=НовоеЗначение;
			Запись.Пользователь		=ПараметрыСеанса.Пользователь;
			Если ОбменДанными.Загрузка Тогда
				Запись.Отправитель		=ОбменДанными.Отправитель;		
				Запись.НомерСообщения	=ПараметрыСеанса.НомерСообщения;
			КонецЕсли;	
			Запись.Записать();
			//кухарь 23.10.14 начало
		КонецЕсли;
		//кухарь 23.10.14 конец
		
	КонецЕсли;
КонецПроцедуры 

Функция ПолучитьСтароеЗначение()
	ДанныеВБазе=РегистрыСведений.СостояниеСкановДокументов.СоздатьНаборЗаписей();
	
	ДанныеВБазе.Отбор.Документ.Установить(Отбор.Документ.Значение);
	
	ДанныеВБазе.Прочитать();
	ТЗ=новый ТаблицаЗначений;
	тз.колонки.Добавить("ЗначениеРеквизита");
	тз.колонки.Добавить("Документ");
	тз.колонки.Добавить("ИмяРеквизита");
	Для Каждого Запись Из ДанныеВБазе Цикл
		стр=тз.Добавить();
		стр.документ=запись.Документ;
		стр.ИмяРеквизита="НомерКоробкиЭД";
		стр.ЗначениеРеквизита=запись.НомерКоробки;
	КонецЦикла;
	возврат ТЗ;
КонецФункции	
//кухарь 20.10.14 конец
